{"inkVersion":21,"root":[["\n",{"->":"follow_shad_whisk"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"follow_shad_whisk":[["#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^I head to the Galley while Pearl disappears, talking to herself like she just failed a hostage negotiation.","\n","^Shad stands over the stove, stirring a pot like it personally offended him.","\n","^He doesn’t even blink when it boils over — it’s like he’s somewhere else.","\n","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"Still mad?\"","\n","#","^speaker:Shad","/#","^\"No… well yeah maybe. I know it’s childish and I don’t want to feel this way but I just do.\"","\n","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"Didn’t know a whisk could cause so much emotional damage.\"","\n","#","^speaker:Shad","/#","^\"Wasn’t just a whisk. I’ve had it since my first proper kitchen. Before all this — before the pirate stuff.\"","\n","^(He pauses, then laughs a little.)","\n","#","^speaker:Shad","/#","^\"Yeah maybe it is a dumb reason to be upset. I’m not great at a lot of things, but cooking? That’s my thing. And that whisk was part of that, you know?\"","\n","^(For once, he doesn’t have his usual goofy smile. He’s just... kind of honest.)","\n","ev","str","^You're a mystery","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Dimiss the whisk","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"shad_follow_flirt"},{"#f":5}],"c-1":["\n",{"->":"shad_follow_disinterest"},{"#f":5}]}],{"#f":1}],"shad_follow_flirt":["ev",{"VAR?":"Shad_Affection"},10,"+",{"VAR=":"Shad_Affection","re":true},"/ev","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"Well your food might be a mystery, but your heart? That’s seasoned just right.\"","\n","^(His eyes widen. He breaks into a sheepish grin.)","\n","#","^speaker:Shad","/#","^\"Really? Me? People usually call me a walking hazard or a kitchen apocalypse.\"","\n","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"Maybe. But you care — and that’s what counts. You’re the type of person who’d burn a cake trying to make someone feel better.\"","\n","#","^speaker:Shad","/#","^(chuckling)","\n","^\"Guilty as charged. I have. Twice.\"","\n","^(He pauses. The laughter fades into something softer, more intimate.)","\n","#","^speaker:Shad","/#","^\"Thanks, Cap’n. I really appreciate being seen like that — as myself.","\n","^Not just a chaotic mess or the guy who’s comedic relief.\"","\n","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"I guess I’ll just have to keep complimenting you then.\"","\n","^(Shad grins, voice dropping just a little.)","\n","#","^speaker:Shad","/#","^\"Careful Cap’n. You keep that up and I might start thinking you’re sweet on me.\"","\n","^(He leans in to whisper.)","\n","#","^speaker:Shad","/#","^\"And if you are... well, I’m not exactly known for resisting temptation.\"","\n","^(I smirk and step out of the galley, leaving him to wonder what my actions mean.)","\n",{"->":"shad_follow_stu_soft"},{"#f":1}],"shad_follow_disinterest":["ev",{"VAR?":"Shad_Affection"},10,"-",{"VAR=":"Shad_Affection","re":true},"/ev","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"I mean sure — but it’s also just a whisk. Not your childhood dog.\"","\n","^(Shad blinks. His soft smile falters just a little.)","\n","#","^speaker:Shad","/#","^\"Right... yeah. Just a whisk. Obviously.\"","\n","^(He stirs the pot again — more out of habit.","\n","^The bubbling sounds a little too loud, but maybe it’s just the silence between us.)","\n","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"You’re an alright cook, Shad. Just save the emotional breakdowns for something that actually matters.\"","\n","^(He doesn’t respond immediately. Instead, he gives a sharp nod and a tight smile that doesn’t reach his eyes.)","\n","#","^speaker:Shad","/#","^\"Yup. Got it, Cap’n. Back to business.\"","\n","^(I walk out before the quiet becomes even more awkward.","\n","^Behind me, a metal spoon hits the floor — he doesn’t pick it up right away.)","\n","^(For a guy who always fills the room with noise, this silence feels heavier than anything he’s ever set on fire.)","\n",{"->":"shad_follow_stu_cold"},{"#f":1}],"shad_follow_stu_soft":["#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^Stu’s perched just outside the galley, poorly pretending not to have been eavesdropping.","\n","#","^speaker:Stu","/#","^\"Squaaak — someone’s turning up the heat in more ways than one.\"","\n","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"He’s charming. In a reckless, flammable type of way.\"","\n","^(I glance back toward the galley door where laughter and the clanging of pans still echo.)","\n","^(We keep walking. The air is cooler out here, but it still feels like something’s heating up.)","\n","end",{"#f":1}],"shad_follow_stu_cold":["#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^I step onto the upper deck. The air hits colder than before — or maybe I just feel colder.","\n","^(Stu is perched on the railing, waiting for me.","\n","^He doesn’t say anything at first, just judges me with those birdy eyes.)","\n","#","^speaker:Stu","/#","^\"Squaaak — that was… something.\"","\n","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"It was a whisk. Not a tragedy. He’ll get over it.\"","\n","^(I lean against the railing, eyes roaming anywhere but the galley.)","\n","#","^speaker:","ev",{"VAR?":"Name"},"out","/ev","/#","^\"I’m not here to coddle feelings.\"","\n","#","^speaker:Stu","/#","^\"No, you’re a leader.","\n","^But leading doesn’t mean leaving your crew bleeding on the inside.\"","\n","^(The wind shifts. I instinctively rub my arms.)","\n","#","^speaker:Stu","/#","^\"You don’t have to love the guy. But you looked him right in the eye and kicked down the only thing he’s ever opened up about.\"","\n","#","^speaker:Stu","/#","^\"That kind of bruise doesn’t show on the surface — but it lingers.\"","\n","^(I don’t respond. I grip the railing tighter and stare into the sea.","\n","^The waves sound louder than they should.)","\n","end",{"#f":1}],"global decl":["ev",0,{"VAR=":"Pearl_Affection"},0,{"VAR=":"Shad_Affection"},0,{"VAR=":"Rory_Affection"},0,{"VAR=":"Ravynn_Affection"},"str","^","/str",{"VAR=":"Name"},"str","^","/str",{"VAR=":"PronounHe"},"str","^","/str",{"VAR=":"PronounHim"},"str","^","/str",{"VAR=":"PronounHisApple"},"str","^","/str",{"VAR=":"PronounHis"},"str","^","/str",{"VAR=":"rory_exit_type"},"str","^","/str",{"VAR=":"shad_exit_type"},"str","^","/str",{"VAR=":"pearl_exit_type"},"/ev","end",null],"#f":1}],"listDefs":{}}